{"inkVersion":16,"root":[{"#":"Music:Drafty Places"},{"#":"BGS:Snow"},"^Cloaks billowing outward in the winds, the two Firryn trudged onward through the feet-high snow, leaving the last WayFlag behind them.  It wouldn’t be long before they reached the village’s outskirts.","\n","^Most of the journey had been in silence, Wu watching with fascination as the seasoned Snowcloak guided them through the featureless wastes. Wu, trudging up in a jog to be at Iyu’s side, looked up at him with frosted goggles.","\n","^Iyu prepared himself, already knowing the conversation that was about to be struck up.","\n","^‘So what do you do out here?’ and ‘Why do you live so far away?’ Snowpilgrims didn’t often get to meet with Snowcloaks unless there were emergencies - so there were always questions about how he lived any time he met someone new.","\n","^He didn’t begrudge the kid for wanting to know these things -- but he was a little tired of explanations.","\n",["ev","str","^Ignore him","/str","/ev",{"*":"12.c","flg":20},{"c":[{"->":"Banshee_InternalThoughts"},{"#f":7}]}],["ev","str","^Humor him ","/str","/ev",{"*":"13.c","flg":20},{"c":[{"->":"Wu_Conversation"},{"#f":7}]}],"done",{"Wu_Conversation":["^“Mr. Iyu,” Wu asked, “why do you live all the way up there on that cliff?  You could live anywhere, right?”","\n","^Iyu looked down at Wu, eyebrow raised.  With a shake of his head, like the reason should be obvious, he returned his gaze to the snowy horizon.","\n","^“We’d welcome you, you know, in the village. My mom’s always talking about how lonely you must be.”","\n","^Iyu grunted. “That’s nice.”","\n","^“But why not? You’ve been up there thirty years now, right? So you don’t go home to Mt. Cylberyxx - you could have a home right here!”","\n","^“They’d starve.”","\n","^“What?”","\n","^“My family,” he looked back at Wu. “That’s the trade. I man this line, they get shelter from this damn cold and some of the food you pilgrims grow.”","\n","^“Oh.” Wu looked away, to the snow. His pace slowed as he tried to imagine how it all fit together.","\n","^The winds howled dully, filling the emptiness for a few minutes. Iyu looked back at the Wayflags in the distance as they shrunk out of sight. They were still headed the right way.","\n","^“But... couldn’t we just send them some of our share?”","\n","^His eyes narrowed. Something was wrong - the winds had the tones of a voice in them.  Spirits, maybe?  It could be nothing, but...","\n","^“Mr. Iyu?”","\n",["ev","str","^Warn him","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"Banshee_1"},{"#f":7}]}],["ev","str","^Keep talking","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"Banshee_Unaware"},{"#f":7}]}],{"#f":3}],"Banshee_InternalThoughts":["^As quickly as the opportunity for conversation came, it went. Noticing Iyu’s hesitation, Wu fell back to walking behind Iyu with a disappointed expression.","\n","^It was for the best, Iyu thought. There’s no need to burden Wu with the harsh realities of living in Fyra at such a young age - especially if he was so ignorant of it.","\n","^The thought of someone so naieve on the outskirts made Iyu’s blood boil. What irresponsible parent would coddle their child so much that they didn’t even know something as basic as the roles of the snowpilgrim and the snowcloak?","\n",{"->":"Banshee_Unaware"},{"#f":3}],"Banshee_Unaware":[{"#":"SFX:BansheeHowl"},"^The sound caught him off guard and reaching for his weapon. Something between a shriek and a wolf’s howl, a Banshee bayed from  somewhere nearby.","\n","^Moments passed. Iyu’s eyes darted around as he motioned for the boy to stay still. Obediently, Wu froze in place, his head slowly vanishing into the scarf around his shoulders. The call was close - no more than a hundred feet away if Iyu trusted his ears.","\n","^His blood ran cold as another, more distant, call answered the first. “Damn,” he swore under his breath, “it’s a pack.”","\n",{"->":"Banshee_1"},{"#f":3}],"Banshee_1":["^His hand slowly reached for his sword only to grasp air. Surprised, he looked down to discover it wasn’t on his waist.  Then it dawned on him -- he’d left it back at camp.","\n","^He cursed, internally, but who could’ve predicted encountering a pack of Banshee out here in wastes? Their hunting grounds were to the west - and they never ventured this far out for prey.","\n","^A bone-chilling shriek echoed around them, very close now. Wu, losing his composure, staggered to Iyu with a whimper and clung tight.","\n","^Iyu quickly surveyed his options. Without a weapon, fighting hand to hand with a Banshee was suicide. But if they ran, the Banshee would give chase -- and they didn’t trudge through the snow but ran atop it with their large webbed feet. They wouldn’t get far.","\n","^He looked to the horizon -- he could just barely make out Winterhold. He could use the small horn on his waist to try and call for help from the settlement while they made a run for it - hopefully the pilgrims would meet them halfway.","\n","^His lantern. Inside it, the crystal continued to glow. Banshee hated Wayfinding crystals - something about the dull hum of them really pissed them off. But the sound was dull inside the lantern - he’d have to pull it out by hand and hold it high.","\n","^At best, he’d get away with some serious burns.","\n","^Finally, if legends (really, some old folk tales told around campfires) held true, Banshee only had nostrils and large ears to see the world around them. If they laid flat on the snow and covered themselves up, maybe the Banshee would pass them by?","\n",["ev","str","^Call for Help","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"Call_1"},{"#f":7}]}],["ev","str","^Use the Crystal","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"Crystal_1"},{"#f":7}]}],["ev","str","^Hide","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"Hide_1"},{"#f":7}]}],{"#f":3}],"Call_1":["^Grabbing Wu and stuffing him under his armpit with one hand and grabbing the horn from the other, Iyu burst into action. Snow kicked up behind them and moments later, the Banshees were barking at each other.","\n","^Bringing the leather-wrapped, carved-out horn to his lips, he blew as hard as he could. A dull and low note sounded, intense enough to make Iyu’s teeth rattle as he continued to bite down on the instrument.","\n","^With the howling in the wind and their distance, he wasn’t sure if the call would even reach the town -- but he had no chance of fighting off a whole pack of Banshee on his own.","\n","^Even at Iyu’s athletic pace, it’d take them a few minutes to reach the village. As the shrieks got closer and closer, he doubted they’d last that long. Wu choked through a half-whispered prayer to the Gods as Iyu continued to sprint.","\n","^A flash of motion brought them skidding to a stop.  There were barks all around them now - searching.  Hunting.  Wu began to quietly weep.","\n","^Iyu grit his teeth. Their chances of survival were getting worse by the moment.","\n",["ev","str","^Hide Wu","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"Call_2"},{"#f":7}]}],["ev","str","^Lead the Banshees Away","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"Call_2B"},{"#f":7}]}],{"#f":3}],"Call_2":["^asdf","\n",{"#f":3}],"Call_2B":["^asdf","\n",{"#f":3}],"Crystal_1":["^Setting down the lantern in the snow, Iyu quickly got to work dismantling the decorative ancient cage surrounding it.  It all fit together like a puzzle - no screws or nails - but that meant he had to take it apart like one or risk jamming it.  Even the glass wouldn’t yield to a large hammer.","\n","^He didn’t have time.  He needed an extra pair of hands or they’d be on them well before he got the thing apart.","\n","^Wu looked around, teeth grit and eyes wide.  “M-Mr. Iyu? What is that?”","\n","^“Banshee - and if you don’t get over here and help, the last thing you’re ever going to see.”","\n","^With a nervous laugh and another series of rapid glances, Wu took a step - then another, and finally ran to Iyu.","\n","^“Hold this,” Iyu directed to Wu as he growled at one of the pieces that stubbornly was refusing to move. Looking up occassionally as the shrieks got closer, Iyu guided Wu as best he could - but they had run out of time.","\n","^Iyu reached in to the now finally disassembled housing just as Wu stumbled backwards, shrieking incoherently and pointing to just behind Iyu.","\n","^An icy breath chilled his neck as his fingers grasped the crystal and he howled in pain. A bubbling sizzle erupted from his palm as his skin was seared by the crystal’s potent energy. Pushing the pain aside, he rolled on to his back and held it up like a shield.","\n",{"->":"Banshee_Description_Crystal"},{"#f":3}],"Hide_1":["^asdf","\n",{"#f":3}],"Banshee_Description_Crystal":["^asdf","\n",{"#f":3}],"#f":3}],"listDefs":{}}