{"inkVersion":16,"root":[{"->":"Main"},"done",{"Main":[{"#":"Music:WhisperLow"},{"#":"BGS:Snow"},"^A","\n","^Cloaks billowing in the wind, the two Firryn trudged onward through the feet-high snow.","\n","^Weaving between the Wayflags and passing the aging ancient towers, they had made great progress to Winterhold.  If their luck held they'd arrive in a matter of minutes.","\n","^Most of the journey had been in silence as Iyu skillfully guided them through the mostly featureless wastes and blinding snow. Wu followed close behind, trying to memorize Iyu's movements and judgment.","\n","^It was when they had just passed the last of the Wayflags that Wu trudged up to Iyu's side. Gathering his courage, Wu looked up through frosted goggles at Iyu and tugged at his snow-covered cloak.","\n","^Iyu mentally groaned, knowing already the questions the boy had.","\n","^Snowpilgrims didn't often meet with Snowcloaks unless there were emergencies and from the star-struck look the boy had greeted him with, he could tell Wu was fascinated with him.","\n",["ev","str","^Ignore Wu","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"no_talk"},{"#f":7}]}],["ev","str","^Humor Wu","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"talk"},{"#f":7}]}],{"#f":3}],"talk":[[["^Wu asked Iyu about...","\n",["ev","str","^Living with him","/str",{"VAR?":"LivingWithWuVar"},0,"==","/ev",{"*":".^.c","flg":5},{"c":[{"->":"talk.0.LivingWithWu"},{"#f":7}]}],["ev","str","^What Iyu does","/str",{"VAR?":"SnowCloakProfessionVar"},0,"==","/ev",{"*":".^.c","flg":5},{"c":[{"->":"talk.0.HarshTurndown.SoftTurndown.SnowCloakProfession"},{"#f":7}]}],["ev","str","^That strange sound","/str",{"VAR?":"LivingWithWuVar"},1,"==",{"CNT?":"talk.0.HarshTurndown.SoftTurndown.SnowCloakProfession"},1,"==","&&","/ev",{"*":".^.c","flg":5},{"c":[{"->":"Howling"},{"#f":7}]}],{"#f":7,"#n":"ConvoTop"}],{"LivingWithWu":["^\"Mr. Iyu, why do you live all the way up there on that cliff?\"","\n","^\"You could live anywhere, right?\"","\n","^\"We'd welcome you, you know, in the village.  My mom's always talking about how lonely you must be.\"","\n","^Iyu grunted. \"That's nice.\"","\n","^\"But why not? You've been up there thirty years now, right?\"","\n","^\"So you don't go home to Mt. Cylberyxx - you could have a home in the village!\"","\n",["ev","str","^Let Wu down easy","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"talk.0.HarshTurndown.SoftTurndown"},{"#f":7}]}],["ev","str","^Let Wu down hard","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"talk.0.HarshTurndown"},{"#f":7}]}],{"#f":7}],"HarshTurndown":["^\"They'd starve.\"","\n","^\"What?\"","\n","^\"My family,\" Iyu looked down at Wu, \"That's the trade. I stay up there and my family gets shelter from this damn cold and some of the food you pilgrims grow.\"","\n","^\"But Winterhold's only a few miles away!\" Wu's face scrunched with doubt.","\n","^\"And Springhold's another hundred, kid.\" Iyu sighed, grasping the back of his neck to work out the knot that was forming there. \"Where your mother and the rest of the pilgrims go, I can't follow.\"","\n","^\"Oh.\" Wu looked down, disappointed.","\n","ev",1,"/ev",{"temp=":"LivingWithWuVar","re":true},["^\"I'll think about it.\"","\n","^\"Really?\" Wu grabbed his cloak, hopping in excitement.","\n","^Iyu couldn't help but chuckle under his breath. \"I just said I'd think about it, kid.\"","\n","^Wu either didn't hear him or ignored him as he excitedly chattered about the village and how well Wu would fit in there and how great the village was and how amazing the people of Winterhold were.","\n","^Iyu let the kid babble, turning his attention back to the snow around them with the faintest hint of a smile on his lips.","\n","^The smile faded away as he reminded himself that he couldn't give in to Wu's request. How could he desert his family to a life without food or shelter? To the life he was living right now?","\n","^An urgent tug on his cloak pulled him from his thoughts.  \"Mr. Iyu?\"","\n","^\"What is it now, kid?\"","\n","ev",1,"/ev",{"temp=":"LivingWithWuVar","re":true},{"->":"talk.0.ConvoTop"},["^\"What do you do up there?\"","\n","^\"I watch for intruders. That's what Snowcloaks do - we keep you Snowpilgrims safe.\"","\n","ev",1,"/ev",{"temp=":"SnowCloakProfessionVar","re":true},{"->":"talk.0.ConvoTop"},{"#f":7,"#n":"SnowCloakProfession"}],{"#f":7,"#n":"SoftTurndown"}],{"#f":7}]}],{"#f":3}],"no_talk":["^Noticing Iyu's hesitation, Wu slowed his pace and fell back in line. Wu glanced back to check on him and found Wu staring at the snow, disappointment spread across his face.","\n","^'It's for the best,' Iyu thought.  There was no need to burden Wu with the harsh reality of living in Fyra at his young age.","\n","^His questions would've only ended in his disappointment.  Better to let him take the bitter pill now than build his expectations.","\n","^Iyu turned his gaze to the snow. It wouldn't be long now until they reached Winterhold.","\n",{"->":"Howling"},{"#f":3}],"Howling":["^\"What?\" Iyu stopped suddenly as he heard it.","\n",{"#":"Music:WhisperHigh"},"^Something was wrong: the winds had the tones of a voice in them.","\n","^'Spirits?' Iyu bent down and grabbed a handful of snow.  He rubbed it between his fingers but didn't see any smoke. 'No, not spirits...'","\n","^'Celanos' Madness?' He ungloved his hand, checking for the telltale blue tints, but all seemed well.","\n","^Wu, meanwhile, shuffled his feet anxiously.  His head whipped about, trying to follow the voice in the snowy winds.","\n","^A bone-chilling shriek echoed through the empty plains, stopping Iyu in his tracks. Wu shrieked as well, eyes wide with fear. \"M-Mr. Iyu!\"","\n","^Iyu grit his teeth. 'Banshee.' Long-limbed man-hunters who ate men to their marrow and left survivors under their curse.","\n","^Another call, this one closer than the first. Something between a shriek and wolf's howl. Moments passed - everything had become very silent and still.","\n","^Iyu looked to Winterhold -- it wasn't far now. If they made a break for it, they'd make it. If the Banshee had already caught their scent they wouldn't shake it or be able to hide from it.","\n","^Iyu's legs and heart were good for it but Wu was frozen in fear, fingers trembling and lips pressed so tight they trickled blood. He wouldn't make it.","\n","^\"W-what is that, Mr. Iyu?\"","\n",["ev","str","^Pick Wu up and run","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"Running"},{"#f":7}]}],{"#f":3}],"Running":[["^In a burst of speed Iyu grabbed the child and hurled himself towards Winterhold. His every step smashed deep into the snow, hurling debris in all directions as the wind bit at his eyes.","\n","^The shrieking was all around now.  Iyu cursed the Gods as he realized it wasn't just one Banshee pursuing them - it was a pack.","\n","^The aged wooden walls were close now - seconds away. A confused guard stood at the gate, his hand reaching for a sword belted to his waist as Iyu charged towards him.","\n","^\"Banshee,\" Iyu yelled, \"blow your horn!\"","\n","^The man shook his head, confused, and Iyu was now nearly upon him.","\n",["ev","str","^Explain","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":".^.^.^.Explain"},{"#f":7}]}],["ev","str","^Grab the horn and blow it","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":".^.^.^.Explain.GrabHorn"},{"#f":7}]}],{"Explain":["^Dropping Wu to his feet, Iyu yelled at the guard as he drew his sword. \"Get your horn and blow it, you fool!\"","\n","^\"Who are you? A Snowcloak?\"","\n","^Iyu growled, \"Don't you hear them, you deaf idiot? Keep rattling that sword and we'll all be dead!\"","\n","^The guard finally heard one of the barks that were now rapidly approaching. \"Oh, Gods! Those are Banshee howls! Kagosho protect us!\"","\n","^\"The horn!!\"","\n","^Shaken loose from his stupor, the guard looked to Iyu and then to the horn on his belt. \"The horn?\" He paused for a moment and then it clicked.","\n","^\"The horn,\" he yelled, panicked, as he ripped the thing from the string binding it to his waist and brought it to his lips. ",{"->":".^.GrabHorn.HornBlow"},"\n",["ev","str","^wounded","/str","/ev",{"temp=":"guard_state","re":true},"^Dropping Wu quickly, Iyu hurled his shoulder into the man's stomach. Wheezing, doubled-over, the man staggered backwards. In that moment of weakness, Iyu ripped the nicely tied horn from the man's waist and brought it to his lips.","\n","^The yapping, barking, howls of the Banshee was all around. In moments, they would pounce. With a hurried breath, Iyu brought the horn to his lips and blew as hard as he could.","\n",{"->":".^.HornBlow"},["^A squeeling, screetching, nails-on-chalkboard-like sound rushed out and the Banshee shrieked along with it.  ",["G>","ev",{"VAR?":"guard_state"},"str","^wounded","/str","==","/ev",[{"->":".^.b","c":true},{"b":["^Iyu's eyes closed tightly as he pushed past the pain of the sound and continued to blow.",{"->":".^.^.^.9"},null]}],"nop","G<",null],"\n","^Wu and the guard both groaned, clasping their ears as their bodies were wracked with pain. Whatever they all felt, the Banshees were feeling ten-fold, their senses sharp enough to track men through heavy snow and fog from miles away.","\n","^The yipping and barking turned to pained whines and screams. The sounds tore into the distance as the Banshee fled.","\n",["G>","ev",{"VAR?":"guard_state"},"str","^wounded","/str","==","/ev",[{"->":".^.b","c":true},{"b":["^Iyu continued blowing, just for good measure, for several seconds after he could no longer hear them.",{"->":".^.^.^.9"},null]}],"nop","G<",null],"\n",{"#":"Music:Surreal"},["G>","ev",{"VAR?":"guard_state"},"str","^wounded","/str","==","/ev",[{"->":".^.b","c":true},{"b":[{"->":"GuardWounded"},{"->":".^.^.^.9"},null]}],"nop","G<",null],"\n",["G>","ev",{"VAR?":"guard_state"},"str","^fine","/str","==","/ev",[{"->":".^.b","c":true},{"b":[{"->":"GuardFine"},{"->":".^.^.^.9"},null]}],"nop","G<",null],"\n",{"#f":7,"#n":"HornBlow"}],{"#f":7,"#n":"GrabHorn"}],{"#f":7}]}],{"#f":3}],"GuardWounded":["^He turned to check on Wu but was knocked to his feet by an iron-clad fist. Vision blurred and head pounding, he looked up to stare down the loaded channel of an ornate looking crossbow.","\n","^At the other end of it was a tall Firryn woman with wild brown hair and eyes lit in rage. Springing forward, Wu grabbed at the crossbow and struggled to pull it out of her hands.","\n","^\"No!  Don't shoot Mr. Iyu!\"","\n","^The woman's eyes widened as, in the struggle, the bolt loosed.","\n","^The world went white in a flash.","\n","^The next thing Iyu felt was a furred hand shaking him. Groggily, his eyes opened. Wu and the woman both leaned over his prone body.","\n","^The snow around his head had been blown away and just inches from his ear rested a thick, black, bolt sunk several inches into the rocky ground.","\n","^Shaking off the drowsiness, Iyu came to his feet. The woman helped him and patted him on the back.","\n","^\"You alright? You must have the blessing of Voshim - that bolt near took your head off thanks to your kid here.\"","\n","^Wu looked away, cheeks rosy and eyes red from tears.","\n","^Iyu grunted. \"I doubt I've the blessing of any of the Gods. Else, I'd be home by now.\"","\n",{"->":"GuardFine.0.AlrightFear.HomeNow.IzaldaBridge"},{"#f":3}],"GuardFine":[["^Stomping up, a huge Firryn woman with a heavy crossbow slung across her back yelled at the guard. \"What in Zohulus' False Fires was that, Kurrin?\"","\n","^She and the guard immediately launched into debate over when to use the horn and what he thought he heard versus what Iyu told him. Iyu had half a mind to butt in - but Wu's shaking body caught his eye.","\n","^Getting down on one knee, Iyu comforted the boy with a hand on his shoulder. \"You alright, kid?\"","\n","^Cheeks wet with tears, he forced a smile and nodded. \"Y-yeah, Mr. Iyu! I'm fine.\"","\n",["ev","str","^It's alright to be afraid.","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":".^.^.^.AlrightFear"},{"#f":7}]}],["ev","str","^You're home now.","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":".^.^.^.AlrightFear.HomeNow"},{"#f":7}]}],{"AlrightFear":["^Wu looked down at the dirty snow. He opened his mouth but then closed it. He furrowed his brow. \"You weren't afraid.\"","\n","^Iyu laughed. \"Yeah, kid, I was. Anyone who can face down a Banshee with no fear isn't Firryn.\"","\n","^\"You're... different.\" Wu looked up at Iyu, something deep behind his eyes. His expression was as complicated as his emotions. \"Everyone says the Snowcloaks are fearless and dangerous.\"","\n","^\"I... I didn't think you were dangerous.  But you're alone up there, all the time, right?\"","\n","^Wu's eyes sunk to the ground, fighting back tears. \"I'm alone a lot too - and I get afraid when I'm alone. And sad. I thought you'd...\"","\n","^Wiping his eyes with the back of his hand, Wu stood on shaky feet.  Iyu helped steady him. He was thinking up a reply when the huge Firryn clapped his shoulder.","\n","^\"You and I, Snowcloak,\" she growled as she spun him around to face her, her eyes darting to the sniffling Wu and back to Iyu, \"we're gonna have a talk about responsibility.\"","\n",{"->":".^.HomeNow.IzaldaBridge"},["^\"Take it easy, kid. You're home now.\"","\n","^Wu nodded, wiping tears away from his eyes. \"I-I know. Thank you, Mr. Iyu.\"","\n","^Wiping his eyes with the back of his hand, Wu stood on shaky feet.  Iyu helped steady him. He was thinking up a reply when the huge Firryn clapped his shoulder.","\n","^\"You and I, Snowcloak,\" she growled as she spun him around to face her, her eyes darting to the sniffling Wu and back to Iyu, \"we're gonna have a talk about responsibility.\"","\n",{"->":".^.IzaldaBridge"},["^Standing a little over a head taller than Iyu was a woman who had more in common with trees than she did with the Firryn.  Packed with muscles barely contained by her armor, Iyu could've been fooled into mistaking her for a short Grynan.","\n","^She took a long, scowling, draw of the frigid air and released it. Her eyes intense, she released Iyu from her strong grip and folded her arms across her considerably broad chest.","\n","^\"Kirrin is a lout. He's a fool and an idiot. But you,\" she punctuated with a finger prodding into Iyu's chest, \"brought a damn pack of Banshee down on Winterhold.\"","\n","^\"Far as I'm concerned, you're not welcome here,\" she growled. With an exhausted grunt she ran her hands through her messy hair. \"And you put that kid in danger too; a fucking kid, Snowcloak.\"","\n","^She leaned in, whispering so Wu wouldn't hear. \"Natural-born kids like Wu are becoming a rare thing out here. A lot of girls die just attempting birth, understand?\"","\n","^\"But!\" Her voice raised back to its normal booming volume, \"apparently, I'm to bring you to the village the moment I see you. Even though I'd rather kick your ass out into the snow.\"","\n","^\"So, help me understand, Snowcloak Iyu. Why in the name of Kagosho should I even think of letting you in?\"","\n",{"->":"IzaldaConvo"},{"#f":7,"#n":"IzaldaBridge"}],{"#f":7,"#n":"HomeNow"}],{"#f":7}]}],{"#f":3}],"IzaldaConvo":[[["ev","str","^Delgof wants to meet with me","/str",{"CNT?":".^.^.DelgofExcuse"},0,"==","/ev",{"*":".^.c","flg":5},{"c":[{"->":".^.^.^.DelgofExcuse"},{"#f":7}]}],["ev","str","^I promised to return Wu home","/str",{"CNT?":".^.^.DelgofExcuse.WuExcuse"},0,"==","/ev",{"*":".^.c","flg":5},{"c":[{"->":".^.^.^.DelgofExcuse.WuExcuse"},{"#f":7}]}],["ev","str","^I saved this village","/str",{"CNT?":".^.^.DelgofExcuse.WuExcuse.SaviorExcuse"},0,"==","/ev",{"*":".^.c","flg":5},{"c":[{"->":".^.^.^.DelgofExcuse.WuExcuse.SaviorExcuse"},{"#f":7}]}],["ev","str","^Wu wouldn't have made it on his own","/str","/ev",{"*":".^.c","flg":4},{"c":[{"->":".^.^.^.DelgofExcuse.WuExcuse.SaviorExcuse.WuHelpsOut"},{"#f":7}]}],{"DelgofExcuse":["^\"Yeah, that's what he said.\" She snorts, eyebrows furrowed. \"And I say you never arrived,\" she said, staring daggers at the guard on post.","\n","^He shrunk in hrs armor, nodding. \"Y-yeah, never saw him.\"","\n",{"->":".^.^.^"},["^She scoffs. \"A fine job you were doing. I think I can take him home from here.\"","\n","^\"I don't want to go home with you, I want to go home with Iyu!\" Wu grabbed her leg and shook it, scowling.","\n","^\"You're safer with me than with him. It's what your mother would want.\"","\n",{"->":".^.^.^.^"},["^\"Oh yeah. You sure saved us by bringing a bunch of Banshee in and threatening all our lives.\"","\n","^\"In the future, I'd rather you not save us if that's alright with you.\"","\n",{"->":".^.^.^.^.^"},["^Wu shrank back as the woman stared at him.","\n","^\"Oh yeah?\" She takes a moment, as if seeing Wu for the first time. \"Come to think, who even let you out of the village, Wu?\"","\n","^Wu stammered, trrying to come up with an excuse. \"W-well, I...\"","\n","^\"You went off on your own?\" She states it more as a fact than a question. \"Did you even tell your mother where you were going?\"","\n","^\"I... she was out hunting and I heard Delgof talking about Iyu and...\"","\n","^\"And you packed up your things, grabbed that crystal your Snowcloak friend here's carrying, and just walked on over to his camp to get him?\"","\n","^\"You left the village, your mom doesn't even know you're gone, and here you are after nearly bearing ripped apart by Banshee - no thanks to this Snowcloak.\"","\n","^She towered over Wu, scowling down at him. \"Is that about right?\"","\n","^Wu looks over to you, pleading silently.","\n",["ev","str","^Intervene","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":"IzaldaConvo.0.g-0"},{"#f":7}]}],{"#f":7,"#n":"WuHelpsOut"}],{"#f":7,"#n":"SaviorExcuse"}],{"#f":7,"#n":"WuExcuse"}],{"#f":7}],"g-0":["^\"Hey, we're talking about me, remember?\" Iyu said, patting off his clothes. \"Why you should let me in the village?\"","\n",["^The woman turns her head to stare at you. \"I still haven't heard a convincing reason.\"","\n",[{"->":".^.^.^.^.g-3.FinalSolution"},["ev","str","^Don't intervene","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":".^.^.^.^.^.^.g-3"},{"#f":7}]}],{"#f":7,"#n":"g-2"}],{"#f":7,"#n":"g-1"}],{"#f":7}],"g-3":["^Iyu shook his head and Wu gritted his teeth, looking down. ",{"->":".^.FinalSolution"},"\n",["^Frustrated, Wu yelled, \"If you don't let him in, I'll tell everyone about you and Delgof!\"","\n","^\"W-what? What about Delgof?\"","\n","^\"I saw you two alone in the cave last night - I'll tell your husband!\"","\n","^\"T-That's,\" the woman stammered, \"look here, kid, whatever you thought you saw it wasn't--\"","\n","^\"Iyu comes with me or I tell him!\"","\n","^The woman growled at Wu. \"You little sneakthief, you don't tell anyone about that! Understand?\" She looked to the guard, who snapped his attention to the horizon, pretending he hadn't heard anything.","\n","^Walking up to Iyu, she gave him another harsh stare. A moment of tense silence passed.","\n","^\"Fine. Fine! Take the kid to his mother's tent but I'll be watching. Then you come right back, understand?\"","\n","^Her hand tapped the thick rope on her hip. \"You take a tour and I'll have your ass out in the snow faster than you can pray to Pyros, Snowcloak.\"","\n",{"->":"ToTheVillage"},{"#f":7,"#n":"FinalSolution"}],{"#f":7}]}],{"#f":3}],"ToTheVillage":[{"#":"NewPage:village_hub"},"^[They walk in to the village]","\n","^[Description of the village proper] ",{"#":"NewPage:village_hub"},"\n",{"#":"NewPage:village_hub"},"^asdf","\n","done",{"#f":3}],"global decl":["ev",0,{"VAR=":"LivingWithWuVar"},0,{"VAR=":"SnowCloakProfessionVar"},"str","^fine","/str",{"VAR=":"guard_state"},"/ev","end",null],"#f":3}],"listDefs":{}}